app/controllers/shops_controller.rb

INSERT INTO "shops" ("name", "shelves", "unshelvedCandies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "poop"], ["shelves", 2], ["unshelvedCandies", "Poop"], ["created_at", "2022-01-11 22:28:34.083171"], ["updated_at", "2022-01-11 22:28:34.083171"]]
---
  def create
    @shop = Shop.new(shop_params)

    respond_to do |format|
      if @shop.save

DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 1]]
---
  def destroy
    @shop.destroy

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_shop
      @shop = Shop.find(params[:id])